Tekla Open API Reference for Tekla Structures 2025
Localization.GetText Method
 Gets the translation for the current language. The translations are searched with the given identifier string.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetText(
	string name
)
Public Function GetText (
	name As String
) As String
Parameters
name
Type: System.String
The identifier string.
Return Value
Type: String
The translated string.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace